# language: ru

# Тестовые данные:

Функция: Добавление овощей

  Сценарий: Добавление овощей
    * страница "Основная страница" загружена
    * выполнено нажатие на "Песочница"
    * выполнено нажатие на "Список товаров"
    * страница "Страница с товарами" загружена
    * выполнено нажатие на "Добавить"
    * страница "Добавление товара" загружена
    * поле "Наименование товара" заполняется значением "Кабачок"
    * выполнено нажатие на "Тип товара"
    * выполнено нажатие на "Овощ"
    * выполнено нажатие на "Экзотичность"
    * выполнено нажатие на "Сохранить"
    * страница "Страница с товарами" загружена
    * выполнено нажатие на "Добавить"
    * страница "Добавление товара" загружена
    * поле "Наименование товара" заполняется значением "Картошка"
    * выполнено нажатие на "Тип товара"
    * выполнено нажатие на "Овощ"
    * выполнено нажатие на "Сохранить"
    * страница "Страница с товарами" загружена
    * выполнено нажатие на "Меню песочницы"
    * выполнено нажатие на "Сброс"



